[
  {
    "key": "analytics",
    "title": "Reports",
    "subtitle": "Landing Lion's clients' need to make informed decisions on their marketing campaigns quickly. These reports empower our clients' with that ability.",
    "software": ["d3JS", "angularJS", "expressJS", "yeomen", "grunt", "npm", "bower", "git"],
    "repoUrl": "",
    "for": "Landing Lion",
    "forUrl": "http://www.landinglion.com",
    "forLogoUrl": "/assets/img/logos/landinglion.png",
    "bodyImgUrls": ["/assets/img/analytics-reports__all.png"],
    "bodyTexts": ["The goal of these reports is to provide Landing Lion's (LL) clients with deep analytical exploration and discovery of how their marketing campaigns are doing. The reports enable LL clients' to make informed dynamic decisions on their landing pages with the intention of improving conversion rates.", "To promote exploration within the reports, I try to make each as immersive, mutable, and smooth as possible. This is made possible by a client-side data-layer that performs a lot of up-front calculations and then getting creative with several different client-side cache layers before the view renders.", "The client-side data-layer backing a report is built using metrics recorded from landing pages used in their marketing campaigns. Because of this, once a report is rendered, no server-side requests are made. This has obvious trade-offs and I am currently trying some interesting things to help mitigate the costs, which will subsequently assist with scaling."],
    "involved": [],
    "dateBegin": "2015-08-01T04:00:00.000Z",
    "dateEnd": "",
    "isActive": true
  },
  {
    "key": "visualizations",
    "title": "Visualizations",
    "subtitle": "Interactive data info-visualizations implemented with a combination d3JS and angularJS. It's modular, portable, and configurable.",
    "software": ["d3JS", "angularJS", "jQuery", "SCSS", "expressJS", "yeomen", "grunt", "npm", "bower", "git"],
    "repoUrl": "",
    "for": "reverb.io",
    "forUrl": "http://www.reverb.io",
    "forLogoUrl": "/assets/img/logos/reverb-io.png",
    "bodyImgUrls": [""],
    "bodyTexts": ["The key difference between this visualization charting library and the current ones available on the market is the ability able to configure multiple charts to be linked together in a specified manner.", "This means charts can be configured to interact with each other without any custom code. This is made possible by having charts subscribe to specified events on an internal event bus. For example, you could configure a specified line to gain focus, fading out all other lines, on a line chart whenever a region on a map has a specified mouse event fired."],
    "involved": [],
    "dateBegin": "2015-06-01T04:00:00.000Z",
    "dateEnd": "",
    "isActive": true
  },
  {
    "key": "assetManager",
    "title": "Asset Manager",
    "subtitle": "File manager and explorer angularJS submomdule. Easy to configure and drop into any angularJS web application.",
    "software": ["angularJS", "jQuery", "SCSS", "aviary", "expressJS", "yeomen", "grunt", "npm", "bower", "git"],
    "repoUrl": "",
    "for": "reverb.io",
    "forUrl": "http://www.reverb.io",
    "forLogoUrl": "/assets/img/logos/reverb-io.png",
    "bodyImgUrls": [],
    "bodyTexts": ["Reverb.io noticed most projects we were working on required some sort of a file manager and explorer. To avoid a lot of extra work (repeating and duplicating code), I wrote an angularJS git submodule that can be easily configured and included into angularJS project to accomplish this problem. It expects support for a specific, yet standard, RESTful API.", "Assets can be easily moved or bulk-uploaded from your computer through drag-and-drop. Images can be easily previewed in the image previewer. Any asset can be starred, trashed, and restored. Hotkeys are enabled to give power-users maximum control."],
    "involved": [],
    "dateBegin": "2015-02-01T04:00:00.000Z",
    "dateEnd": "",
    "isActive": true
  },
  {
    "key": "toma",
    "title": "TOMA",
    "subtitle": "Trackable Offline Marketing Automation (TOMA) was developed to assist Real Estate agencies acquire higher quality leads to eventually target in their marketing campaigns.",
    "software": ["angularJS", "jQuery", "SCSS", "expressJS", "yeomen", "grunt", "npm", "bower", "git"],
    "repoUrl": "",
    "for": "reverb.io",
    "forUrl": "http://www.reverb.io",
    "forLogoUrl": "/assets/img/logos/reverb-io.png",
    "bodyImgUrls": [],
    "bodyTexts": ["This angularJS module is used to enhance a potential customers profile by acquiring previously unavailable, yet valuable information about them.", "When a client connects to a website that has TOMA embedded, they are asked if they would like to see what properties are currently selling and recently sold for in the near proximity. If they click yes, TOMA then informs them that in order to provide this information they must first permit access their location so we get metrics on the neighboring properties. This allows the Real Estate agent to attain the physical addresses of any lead that visits their website.", "This is incredibly powerful information for any marketing front, giving more precise ad targeting due to higher quality leads.", "Reverb.io sees TOMA having potential application in marketing fronts of different business verticals."],
    "involved": [""],
    "dateBegin": "2014-05-01T04:00:00.000Z",
    "dateEnd": "2014-06-01T04:00:00.000Z",
    "isActive": false
  },
  {
    "key": "hunterBrennick",
    "title": "hunterbrennick.com",
    "subtitle": "Personal portfolio to showcase pieces of some projects I've built.",
    "software": ["angularJS", "Canvas", "jQuery", "SCSS", "expressJS", "yeomen", "grunt", "npm", "bower", "git"],
    "repoUrl": "https://github.com/hvnt/resume",
    "for": "Myself",
    "forUrl": "",
    "forLogoUrl": "/assets/img/favicon-lg.png",
    "bodyImgUrls": [],
    "bodyTexts": ["This angularJS web application serves as a personal sandbox.", "Feel free to reuse any code on the GitHub repository."],
    "involved": [],
    "dateBegin": "2016-03-01T04:00:00.000Z",
    "dateEnd": "",
    "isActive": true
  },
  {
    "key": "mentalDisorders",
    "title": "Mental Disorders",
    "subtitle": "Did you know we lose 25 veterans a day due to Post Traumatic Stress Disorder (PTSD) due to suicide? Our veterans need brand-based prescription anti-depressants to prevent this tragedy.",
    "software": ["jQuery", "stripe", "CSS3", "git"],
    "involved": [""],
    "repoUrl": "https://github.com/HVNT/gramps",
    "for": "mentaldisorders.com",
    "forUrl": "http://www.mentaldisorders.com",
    "forLogoUrl": "/assets/img/logos/mentaldisorders.png",
    "bodyImgUrls": [],
    "bodyTexts": ["Mentaldisorders.com is a website I built for my grandfather to help him market his book on PTSD.", "Read all about PTSD and the steps our government needs to take in order to solve this sad problem in Dr. Herb Wagemaker's new book, \"Surviving PTSD\"."],
    "dateBegin": "2015-09-01T04:00:00.000Z",
    "dateEnd": "2015-09-01T04:00:00.000Z",
    "isActive": true
  },
  {
    "key": "fileAttacher",
    "title": "File Attacher",
    "subtitle": "Simple file manager and explorer used to upload and download patient files to onecare.me.",
    "software": ["knockoutJS", "jQuery", "C#", "ASP.NET MVC", "ravenDB", "AWS S3", "TFS"],
    "involved": [],
    "repoUrl": "https://github.com/HVNT/FileAttacher",
    "for": "OneCare",
    "forUrl": "https://www.onecare.me",
    "forLogoUrl": "/assets/img/logos/onecare.png",
    "bodyImgUrls": [],
    "bodyTexts": ["This is a full-stack, ASP.NET MVC web application with the goal of enabling users to manage and explore their files on the onecare.me site. Because onecare.me is in the health-care space the project had to be compliant with HIPAA, which means encryption and using secure networking protocols.", "You will need to have a login to onecare.me community if you want to see the project. Alternatively, the code is available at the GitHub url provided."],
    "dateBegin": "2014-02-01T04:00:00.000Z",
    "dateEnd": "2014-04-01T04:00:00.000Z",
    "isActive": true
  },
  {
    "key": "reliableTransferSuite",
    "title": "Reliable Transfer Suite",
    "subtitle": "RTS is an abstraction layer over UDP, and mimics the functionality to TCP to a basic degree.",
    "software": ["python", "git"],
    "repoUrl": "https://github.com/HVNT/reliable-transfer-suite",
    "for": "Georgia Tech",
    "forUrl": "http://www.gatech.edu/",
    "forLogoUrl": "/assets/img/logos/georgia-tech.png",
    "bodyImgUrls": [],
    "bodyTexts": ["RTS is a reliable transport layer protocol written in Python. It multiplexes using an asynchronous IO loop."],
    "involved": ["Sherman Mathews"],
    "dateBegin": "2015-10-01T04:00:00.000Z",
    "dateEnd": "2014-11-01T04:00:00.000Z",
    "isActive": false
  },
  {
    "key": "jos",
    "title": "JOS",
    "subtitle": "JOS is an MIT teaching Operating System with a mico-kernel architecture.",
    "software": ["C", "QEMU", "GDB", "xv6", "git"],
    "repoUrl": "",
    "for": "Georgia Tech",
    "forUrl": "http://www.gatech.edu/",
    "forLogoUrl": "/assets/img/logos/georgia-tech.png",
    "bodyImgUrls": [],
    "bodyTexts": ["This project was completed for an Operating Systems class at Georgia Tech."],
    "involved": [],
    "dateBegin": "2016-01-01T04:00:00.000Z",
    "dateEnd": "2016-05-01T04:00:00.000Z",
    "isActive": true
  },
  {
    "key": "geoNews",
    "title": "Geo News",
    "subtitle": "Existing news sites are flat, biased, and cluttered. People want to know what is happening and where; Geo News keeps you informed.",
    "repoUrl": "https://github.com/HVNT/GTNewsDev",
    "software": ["leafletJS", "angularJS", "jQuery", "SCSS", "expressJS", "yeomen", "grunt", "npm", "bower", "git"],
    "for": "Georgia Tech",
    "forUrl": "http://www.gatech.edu/",
    "forLogoUrl": "/assets/img/logos/georgia-tech.png",
    "bodyImgUrls": ["/assets/img/geo-news__main.png"],
    "bodyTexts": ["Geo News is targeted at people with a demanding schedule, but still want to be in the loop on world's current events. Geo News does this by giving people the ability to quickly figure out whats happening and where.",  "Geo News does this by a series of sequential steps. First, Geo News' articles are aggregated from a variety of major news sources. We figured the most subjective way to show what articles the world cared about the most was to only present what the ones that were re-posted the most on popular social media platforms. In order to filter out articles that don't matter (the noise), we interfaced with facebook and twitter to get share counts and retweet counts, respectively.", "Once we have the social impact metrics, articles over a certain social impact threshold are funneled through an ETL geo-locating system to be properly placed on the map, articles under this threshold are not funneled through the ETL system (if there we aren't going to display the article on the map, there is no need to geo-locate it). The article pins are sied relative to their social impact metrics to over-emphasize them relative to the lesser impactful articles.", "This was my senior design project for Georgia Tech."],
    "involved": ["Dylan Jones, Sherman Mathews, Andrew Ford, Devon Cryts"],
    "dateBegin": "2015-09-01T04:00:00.000Z",
    "dateEnd": "2015-12-01T04:00:00.000Z",
    "isActive": false
  }
]